<details><summary>Digger run report at 2024-08-05 12:01:48 (UTC)</summary>
        <details><summary>Apply for <b>anzeha/floorball-fantasy-infra#staging_argo</b></summary>
  
```terraform
Terraform will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "7.3.11"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "configs.params.server.insecure"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "configs.secret.argocdServerAdminPassword"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "server.ingress.enabled"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "server.ingress.ingressClassName"
          + value = "nginx"
            # (1 unchanged attribute hidden)
        }
    }

  # htpasswd_password.hash will be created
  + resource "htpasswd_password" "hash" {
      + apr1     = (known after apply)
      + bcrypt   = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + sha256   = (known after apply)
      + sha512   = (known after apply)
    }

  # kubernetes_ingress_v1.this[0] will be created
  + resource "kubernetes_ingress_v1" "this" {
      + id     = (known after apply)
      + status = (known after apply)

      + metadata {
          + annotations      = {
              + "ingress.kubernetes.io/ssl-redirect"             = "true"
              + "kubernetes.io/ingress.class"                    = "nginx"
              + "nginx.ingress.kubernetes.io/backend-protocol"   = "HTTPS"
              + "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
            }
          + generation       = (known after apply)
          + name             = "argocd-server-http-ingress"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = (known after apply)

          + rule {
              + http {
                  + path {
                      + path      = "/"
                      + path_type = "Prefix"

                      + backend {
                          + service {
                              + name = "argocd-server"

                              + port {
                                  + name = "http"
                                }
                            }
                        }
                    }
                }
            }
        }
    }

  # kubernetes_namespace_v1.floorball_fantasy_namespace[0] will be created
  + resource "kubernetes_namespace_v1" "floorball_fantasy_namespace" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "floorball-fantasy"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
htpasswd_password.hash: Creating...
kubernetes_namespace_v1.floorball_fantasy_namespace[0]: Creating...
htpasswd_password.hash: Creation complete after 0s [id=PW2432612431302437684950683268784d51627841344f684134426e342e5876743548775276796676315a675550576e53635065524434576e6c394853]
helm_release.argocd: Creating...
kubernetes_namespace_v1.floorball_fantasy_namespace[0]: Creation complete after 1s [id=floorball-fantasy]
helm_release.argocd: Still creating... [10s elapsed]
helm_release.argocd: Still creating... [20s elapsed]
helm_release.argocd: Still creating... [30s elapsed]
helm_release.argocd: Still creating... [40s elapsed]
helm_release.argocd: Still creating... [50s elapsed]
helm_release.argocd: Still creating... [1m0s elapsed]
helm_release.argocd: Still creating... [1m10s elapsed]
helm_release.argocd: Still creating... [1m20s elapsed]
helm_release.argocd: Creation complete after 1m24s [id=argocd]
kubernetes_ingress_v1.this[0]: Creating...
kubernetes_ingress_v1.this[0]: Creation complete after 0s [id=argocd/argocd-server-http-ingress]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

  ```
</details>

<details><summary>Apply for <b>anzeha/floorball-fantasy-infra#staging_cluster</b></summary>
  
```terraform
module.gke.random_string.cluster_service_account_suffix: Refreshing state... [id=padx]
module.gke.data.google_container_engine_versions.region: Reading...
module.gke.data.google_container_engine_versions.zone: Reading...
data.google_client_config.default: Reading...
module.gke.google_service_account.cluster_service_account[0]: Refreshing state... [id=projects/floorball-fantasy/serviceAccounts/tf-gke-gke-cluster-sta-padx@floorball-fantasy.iam.gserviceaccount.com]
data.google_client_config.default: Read complete after 0s [id=projects/"floorball-fantasy"/regions/"europe-west4"/zones/<null>]
module.gke.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0]: Refreshing state... [id=floorball-fantasy/roles/stackdriver.resourceMetadata.writer/serviceAccount:tf-gke-gke-cluster-sta-padx@floorball-fantasy.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-metric_writer[0]: Refreshing state... [id=floorball-fantasy/roles/monitoring.metricWriter/serviceAccount:tf-gke-gke-cluster-sta-padx@floorball-fantasy.iam.gserviceaccount.com]
module.gke.google_project_iam_member.cluster_service_account-nodeService_account[0]: Refreshing state... [id=floorball-fantasy/roles/container.defaultNodeServiceAccount/serviceAccount:tf-gke-gke-cluster-sta-padx@floorball-fantasy.iam.gserviceaccount.com]
module.gke.data.google_container_engine_versions.zone: Read complete after 1s [id=2024-08-05 12:04:12.960783845 +0000 UTC]
module.gke.data.google_container_engine_versions.region: Read complete after 1s [id=2024-08-05 12:04:13.180090611 +0000 UTC]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/floorball-fantasy/locations/europe-west4-a/clusters/gke-cluster-staging]
module.gke.google_container_node_pool.pools["node-pool-staging"]: Refreshing state... [id=projects/floorball-fantasy/locations/europe-west4-a/clusters/gke-cluster-staging/nodePools/node-pool-staging]
module.gke_auth.data.google_client_config.provider: Reading...
module.gke_auth.data.google_client_config.provider: Read complete after 0s [id=projects/"floorball-fantasy"/regions/"europe-west4"/zones/<null>]
data.google_container_cluster.gke: Reading...
module.gke_auth.data.google_container_cluster.gke_cluster: Reading...
data.google_container_cluster.gke: Read complete after 0s [id=projects/floorball-fantasy/locations/europe-west4-a/clusters/gke-cluster-staging]
module.gke_auth.data.google_container_cluster.gke_cluster: Read complete after 0s [id=projects/floorball-fantasy/locations/europe-west4-a/clusters/gke-cluster-staging]
data.google_client_config.provider: Reading...
data.google_client_config.provider: Read complete after 0s [id=projects/"floorball-fantasy"/regions/"europe-west4"/zones/<null>]

Changes to Outputs:
  ~ token                  = (sensitive value)

You can apply this plan to save these new output values to the Terraform
state, without changing any real infrastructure.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

cluster_ca_certificate = <sensitive>
host = "https://34.141.232.53"
token = <sensitive>

  ```
</details>


<details><summary>Apply for <b>anzeha/floorball-fantasy-infra#staging_kubernetes-addons</b></summary>
  
```terraform
data.google_client_config.default: Reading...
google_compute_address.ingress[0]: Refreshing state... [id=projects/floorball-fantasy/regions/europe-west4/addresses/gke-test-1-staging-ingress-ip]
data.google_client_config.default: Read complete after 0s [id=projects/"floorball-fantasy"/regions/"europe-west4"/zones/<null>]
module.nginx-controller[0].helm_release.application: Refreshing state... [id=ingress-nginx]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

  ```
</details>


<details><summary>Apply for <b>anzeha/floorball-fantasy-infra#staging_vpc</b></summary>
  
```terraform
data.google_client_config.default: Reading...
google_compute_address.nat: Refreshing state... [id=projects/floorball-fantasy/regions/europe-west4/addresses/gke-1-staging-nat-ip]
module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/floorball-fantasy/global/networks/gke-network-staging]
data.google_client_config.default: Read complete after 0s [id=projects/"floorball-fantasy"/regions/"europe-west4"/zones/<null>]
module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west4/gke-subnet-staging"]: Refreshing state... [id=projects/floorball-fantasy/regions/europe-west4/subnetworks/gke-subnet-staging]
module.cloud-nat.random_string.name_suffix: Refreshing state... [id=9zj0wk]
google_compute_router.this: Refreshing state... [id=projects/floorball-fantasy/regions/europe-west4/routers/gke-1-staging-cloud-router]
module.cloud-nat.google_compute_router_nat.main: Refreshing state... [id=floorball-fantasy/europe-west4/gke-1-staging-cloud-router/gke-1-cloud-nat]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

Outputs:

vpc_network_name = "gke-network-staging"
vpc_subnetwork_name = "gke-subnet-staging"

  ```
</details>

</details>